In [1]:
import pymysql
  

myconn = pymysql.connect(host = "localhost", user = "root",passwd = "sweety110", database='new', autocommit = True, charset = 'utf8mb4', cursorclass = pymysql.cursors.DictCursor)

cursor = myconn.cursor()

In [ ]:
sql = "select * from customer"
cursor.execute(sql)

rows = cursor.fetchall()

print(rows)

In [9]:
import pymysql
  
#Create the connection object   
myconn = pymysql.connect(host = "localhost", user = "root",passwd = "sweety110", database='python', autocommit = True, charset = 'utf8mb4', cursorclass = pymysql.cursors.DictCursor)

cursor = myconn.cursor() 


sql = "create table sales (sid varchar(10)primary key,salesman_name varchar(100),sale_dept varchar(100));"
cursor.execute(sql)

rows = cursor.fetchall()

print(rows)

()

In [10]:
sql = "INSERT INTO sales (sid,salesman_name,sale_dept) VALUES (%s, %s, %s)"
val = [
  ("s1","ankit","home"),
  ("s2","riya","ecommerence"),
  ("s3","bittu","loan"),
  ("s4","arnab","home"),
  ("s5","snehasish","home")
]

cursor.executemany(sql, val)

myconn.commit()

print(cursor.rowcount, "was inserted.")

5 was inserted.

In [11]:
sql = "select * from sales"
cursor.execute(sql)

rows = cursor.fetchall()

print(rows)

[{'sid': 's1', 'salesman_name': 'ankit', 'sale_dept': 'home'}, {'sid': 's2', 'salesman_name': 'riya', 'sale_dept': 'ecommerence'}, {'sid': 's3', 'salesman_name': 'bittu', 'sale_dept': 'loan'}, {'sid': 's4', 'salesman_name': 'arnab', 'sale_dept': 'home'}, {'sid': 's5', 'salesman_name': 'snehasish', 'sale_dept': 'home'}]

In [12]:
sql = "create table emp (eid varchar(10)primary key,emp_name varchar(100),sid varchar(10));"
cursor.execute(sql)

sql = "INSERT INTO emp (eid,emp_name,sid) VALUES (%s, %s, %s)"
val = [
  ("e1","ankit","s1"),
  ("e2","riya","s2"),
  ("e3","bittu","s3"),
  ("e4","arnab","s4"),
  ("e5","snehasish","s5")
]

cursor.executemany(sql, val)

myconn.commit()

print(cursor.rowcount, "was inserted.")


sql = "select * from emp"
cursor.execute(sql)

detail = cursor.fetchall()

print(detail)

5 was inserted.
[{'eid': 'e1', 'emp_name': 'ankit', 'sid': 's1'}, {'eid': 'e2', 'emp_name': 'riya', 'sid': 's2'}, {'eid': 'e3', 'emp_name': 'bittu', 'sid': 's3'}, {'eid': 'e4', 'emp_name': 'arnab', 'sid': 's4'}, {'eid': 'e5', 'emp_name': 'snehasish', 'sid': 's5'}]

In [13]:
sql = "create table dept (deptid varchar(10)primary key,dept_name varchar(100),eid varchar(10));"
cursor.execute(sql)

sql = "INSERT INTO dept (deptid,dept_name,eid) VALUES (%s, %s, %s)"
val = [
  ("d1","sales","e1"),
  ("d2","hr","e2"),
  ("d3","sales","e3"),
  ("d4","hr","e4"),
  ("d5","tech","e5")
]

cursor.executemany(sql, val)

myconn.commit()

print(cursor.rowcount, "was inserted.")


sql = "select * from dept"
cursor.execute(sql)

detail = cursor.fetchall()

print(detail)

5 was inserted.
[{'deptid': 'd1', 'dept_name': 'sales', 'eid': 'e1'}, {'deptid': 'd2', 'dept_name': 'hr', 'eid': 'e2'}, {'deptid': 'd3', 'dept_name': 'sales', 'eid': 'e3'}, {'deptid': 'd4', 'dept_name': 'hr', 'eid': 'e4'}, {'deptid': 'd5', 'dept_name': 'tech', 'eid': 'e5'}]

In [ ]:
SELECT * FROM sales JOIN emp ON sales.sid=emp.sid JOIN dept ON emp.eid=dept.eid;

In [14]:
sql = "select * from sales,emp,dept where sales.sid=emp.sid and emp.eid=dept.eid"
cursor.execute(sql)

detail = cursor.fetchall()

print(detail)

[{'sid': 's1', 'salesman_name': 'ankit', 'sale_dept': 'home', 'eid': 'e1', 'emp_name': 'ankit', 'emp.sid': 's1', 'deptid': 'd1', 'dept_name': 'sales', 'dept.eid': 'e1'}, {'sid': 's2', 'salesman_name': 'riya', 'sale_dept': 'ecommerence', 'eid': 'e2', 'emp_name': 'riya', 'emp.sid': 's2', 'deptid': 'd2', 'dept_name': 'hr', 'dept.eid': 'e2'}, {'sid': 's3', 'salesman_name': 'bittu', 'sale_dept': 'loan', 'eid': 'e3', 'emp_name': 'bittu', 'emp.sid': 's3', 'deptid': 'd3', 'dept_name': 'sales', 'dept.eid': 'e3'}, {'sid': 's4', 'salesman_name': 'arnab', 'sale_dept': 'home', 'eid': 'e4', 'emp_name': 'arnab', 'emp.sid': 's4', 'deptid': 'd4', 'dept_name': 'hr', 'dept.eid': 'e4'}, {'sid': 's5', 'salesman_name': 'snehasish', 'sale_dept': 'home', 'eid': 'e5', 'emp_name': 'snehasish', 'emp.sid': 's5', 'deptid': 'd5', 'dept_name': 'tech', 'dept.eid': 'e5'}]

In [16]:
list=[]
for i in detail:
    
    sid=i['sid']
    salesman_name=i['salesman_name']
    sale_dept=i['sale_dept']
    eid=i['eid']
    emp_name=i['emp_name']
    
    deptid=i['deptid']
    dept_name=i['dept_name']
    
    
    list.append([sid,salesman_name,sale_dept,eid,emp_name,deptid,dept_name])

In [17]:
import pandas as pd
df = pd.DataFrame(list,columns =['sid','salesman_name','sale_dept','eid','emp_name','deptid','dept_name'])

In [18]:
df

  sid salesman_name    sale_dept eid   emp_name deptid dept_name
0  s1         ankit         home  e1      ankit     d1     sales
1  s2          riya  ecommerence  e2       riya     d2        hr
2  s3         bittu         loan  e3      bittu     d3     sales
3  s4         arnab         home  e4      arnab     d4        hr
4  s5     snehasish         home  e5  snehasish     d5      tech

In [23]:

cursor.execute('''SELECT dept_name,emp_name FROM sales JOIN emp ON sales.sid=emp.sid JOIN dept ON emp.eid=dept.eid WHERE dept.dept_name='hr' and emp.emp_name like 'r%';''')

detail = cursor.fetchall()

print(detail)

[{'dept_name': 'hr', 'emp_name': 'riya'}]

In [ ]:

SELECT dept_name,emp_name FROM sales JOIN emp ON sales.sid=emp.sid JOIN dept ON emp.eid=dept.eid WHERE dept.dept_name='hr' and emp.emp_name='r%';